blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Wahoo"], ["body", "It'sd a working!"], ["created_at", "2023-07-30 14:57:51.965754"], ["updated_at", "2023-07-30 14:57:51.965754"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "and ham, with green bits? Blergh!"], ["updated_at", "2023-07-30 13:22:35.483759"], ["id", 4]]
---
  def update
    @article  = Article.find(params[:id])

    if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
  def destroy
    @article  = Article.find(params[:id])
    @article.destroy